yooaroma/yoo_stm8s_sdcc/project/STM8S_Mib/inc/stm8s_mib_debug_cmd.h
/**
  ******************************************************************************
  * @file stm8s_mib_debug_cmd.h
  * @brief 
  * @author MYMEDIA Co., Ltd.
  * @version V1.0.0
  * @date 2023.1.6
  ******************************************************************************
  */
/*
  디버깅 프로그램 설명
  cmd : 명령어
  run 실행 함수 : 명령어에 따른 콜백 함수
  usage : help 리스트 및 사용법에 대한 예제..

  명령어를 uart로 받아 들여서 해석하여 실행한다.

  int GetCommand(char *command, uint16_t len, uint8_t timeout); // sec...
    문자열을 받아 들이는 함수 (UART로 부터 받아 들인다.)
  int GetArgs(char *s, char **args);
    주어진 문자열을 구분하여 주는 함수
  int DoPrintHelp(int argc, char **argv);
    주어진 명령어에 대한 도움말을 표현하여 주는 함수

  int HexToInt(char *s, void *retval, uint16_t type);
    문자를 16진수로 변환하는 함수
  int DecToLong(char *s, void *retval, uint16_t type);
    문자를 십진수로 변환하는 함수
  void HexDump(uint32_t addr, uint32_t len);
    어드레스에 데이터를 hex로 표현하여 주는 함수
*/
/* Define to prevent recursive inclusion -------------------------------------*/
#include "stm8s.h"
#ifndef __STM8S_MIB_DEBUG_CMD_H
#define __STM8S_MIB_DEBUG_CMD_H

//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
#ifdef __cplusplus
 extern "C" {
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define MAX_COMMANDS				(6)
#define MAX_ARGS						(5)
#define CMD_LINE_MAX 				(4)
#define CMD_CHAR_MAX 				(64)
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
struct _CMD_MY {
    char *cmd;			
    int(*run) (struct _CMD_MY * cptr, int argc, char **argv);	
    char *usage;		
};
typedef struct _CMD_MY CMD_MY;
#define CMD_MY_END		{0, 0, 0}
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
struct _CMD_ARRAY {
    uint8_t cur,next;
    char buf[CMD_LINE_MAX][CMD_CHAR_MAX];
};
typedef struct _CMD_ARRAY CMD_ARRAY;
// CMD_ARRAY cmd_list;
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/* Private macro -------------------------------------------------------------*/
#define rd_ADDR32(A)    (*((volatile uint32_t *)(A)))
#define rd_ADDR16(A)    (*((volatile uint16_t *)(A)))
#define rd_ADDR8(A)     (*((volatile uint8_t *)(A)))
#define wr_ADDR32(A,B)  (*((volatile uint32_t *)(A)))=(uint32_t)(B)
#define wr_ADDR16(A,B)  (*((volatile uint16_t *)(A)))=(uint16_t)(B)
#define wr_ADDR8(A,B)   (*((volatile uint8_t *)(A)))=(uint8_t)(B)
/* Public functions ----------------------------------------------------------*/
int GetCommand(char *command, uint16_t len, uint8_t timeout); // sec...
int GetArgs(char *s, char **args);
int DoPrintHelp(int argc, char **argv);

int HexToInt(char *s, void *retval, uint16_t type);
int DecToLong(char *s, void *retval, uint16_t type);
void HexDump(uint32_t addr, uint32_t len);
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
  
#endif /* __STM8S_MIB_DEBUG_CMD_H */


/************************ (C) COPYRIGHT MYMEDIA *****END OF FILE****/
